# read utf-8 file from 小鹤音形单字全码码表
"""
[
  {
    "character": "一",
    "level": "1",
    "fly_code": "yiaa",
    "order": "一",
    "first_part": "一",
    "first_py": "a",
    "last_part": "一",
    "last_py": "a"
  },
    ...
"""

from collections import defaultdict
import json
import os

flypy = None
with open(os.path.join(os.path.dirname(__file__), '小鹤音形单字全码码表.json'), 'r', encoding='utf-8') as f:
    flypy = json.load(f)

# get all first_py and last_py
first_py = defaultdict(set)
last_py = defaultdict(set)

for item in flypy:
    first_py[item['first_py']].add(item['first_part'])
    last_py[item['last_py']].add(item['last_part'])

# sort first_py and last_py by key
first_py = dict(sorted(first_py.items(), key=lambda x: x[0]))
last_py = dict(sorted(last_py.items(), key=lambda x: x[0]))
print(first_py)
print(last_py)

for key in "abcdefghijklmnopqrstuvwxyz":
    # diff = first_py[key] - last_py[key]
    diff = first_py[key] - last_py[key]
    if diff:
        print(key, diff)

first_py = {'a': {'凹', '一', '鱼'}, 'b': {'匕', '疒', '半', '白', '巴', '百', '丷', '丙', '不', '冖', '勹', '宀', '八', '必'}, 'c': {'才', '艹', '册'}, 'd': {'丁', '丹', '歹', '氐', '大', '东', ' 冫', '氵', '丶', '刀', '⺈'}, 'e': {'山', '彐', '儿', '阝', '而', '二', '卩', '耳'}, 'f': {'弗', '缶', '非', '夫', '甫', '方', '卅', '龶', '丰', '寿上', '扌'}, 'g': {'工', '艮', '即左', '弓', '干', '更', '毌', '骨', '戈', '革', '瓜', '果', '广', '鬼', '甘'}, 'h': {'户', '禾', '虍', '黑', '火'}, 'i': {'串', '叉', '尺', '厂', '车', '彳', '出', '成', '臣', '虫', '川', '产'}, 'j': {'臼', '钅', '夹', '斤', '戋', '九', '巾', '己', '久', '龹', '金', '几', '甲'}, 'k': {'口', '匚', '开', '囗', '冂'}, 'l': {'里', '耒', '卵', '丨', '耂', '了', '立', '力', '丽', '来', '龙'}, 'm': {'民', '米', '面', '门', '马', '木', '毛'}, 'n': {'廿', '鸟', '⺧', '牛', '女', '乃', '内'}, 'o': {'日', '目', '月'}, 'p': {'丿', '丕', '爿', '衤', '片', '礻'}, 'q': {'其上', '七', '千', '丘', '具上', '求', '气', '且', '犬', '犭'}, 'r': {'刃', '壬', '冉', '人', '入', '亻'}, 's': {'纟', '龴', '肃', '厶', '巳', '罒', '丝'}, 't': {'天', '田', '土', '太', '屯'}, 'u': {'上', '身', '氏', '尸', ' 士', '水', '申', '矢', '世', '石', '豕', '𠂇', '生', '饣', '少', '束', '十', '龵'}, 'v': {'正', '朱', '爪', '⺮', '中', '止', '乛', '乍', '豸', '舟'}, 'w': {'文', '兀', '我', '勿', '未', '夂', '亡', '万', '亠', '乌', '王', '戊', '午', '五', '韦'}, 'x': {'⺌', '乂', '血', '乡', '小', '忄', '下', '夕', '西', '习', '⺍', '戌'}, 'y': {'尢', '又', '夭', '亚', '⺷', '羊', '酉', '牙', '央', '幺', '弋', '于', '也', '⺶', '由', '业', '尹', '与', '永', '雨', '讠', '禺', '禹'}, 'z': {'自', '⻊', '子', '辶', '廴'}}
last_py = {'a': {'一', '鱼'}, 'b': {'办', '半', '匕', '百', '巴', '卜', '白', '卞', '丙', '不', '本', '八', '必'}, 'c': {'廾', '艹', '才', '寸', '册'}, 'd': {'丁', '丹', '歹', '氐', '大', '刁', '东', '冫', '电', '丶', '刂', '刀'}, 'e': {'山', '彐', '儿', '阝', '而', '见下', '二', '卩', '耳'}, 'f': {'弗', '缶', '非', '凡', '夫', '甫', '方', '龶', '丰', '乏'}, 'g': {'工', '夬', '艮', '弓', '干', '丐', '更', '骨', '鬼', '戈', '革', '瓜', '广', '果', '甘'}, 'h': {'户', '禾', '黑', '灬', '互', '乎', '火', '余下'}, 'i': {'串', '叉', '尺', '厂', '长', '车', '出', '成', '斥', '亍', '虫', '臣', '丑', '川', '产', '垂'}, 'j': {'及', '击', '臼', '夹', '斤', '柬', '井', '戋', '九', '巨', '巾', '己', '久', '甲', '金', '韭', '几'}, 'k': {'口', '匚', '开', '凵', '亏', '㠯'}, 'l': {'里', '耒', '乐', '丨', '两', '了', '良', '立', '力', '丽', '来', '吏', '龙'}, 'm': {'民', '朩', '皿', '丏', '米', '面', '门', '么', '马', '木', '毛', '末', '母'}, 'n': {'ㄟ', '农', '鸟', '牛', '乃', '女', '内'}, 'o': {'日', '曰', '目', '月'}, 'p': {'丿', '丕', '平'}, 'q': {'七', '乞', '千', '具上', '丘', '求', '气', '且', '犬', '曲', '羌'}, 'r': {'刃', '壬', '冉', '亻', '人'}, 's': {'龴', '肃', '三', '厶', '巳', '丝'}, 't': {'天', '田', '土', '太', '屯'}, 'u': {'世', '𠂇', '生', '升', '水', '氺', '上', '尸', '士', '戍', '史', '术', '氏', '石', '豕', '勺', '失', '申', '矢', '手', '少', '束', '十'}, 'v': {'正', '州', '朱', '爪', '之', '中', '乛', '止', '专', '重', '乍', '主', '舟', '丈'}, 'w': {'无', '毋', '夂', '乌', '瓦', '攵', '万', '兀', '文', '戊', '午', '韦', '我', '勿', '亡', '为', '丸', '王', '未', '五'}, 'x': {'乂', '血', '⺗', '乡', '小', '下', '夕', '西', '习', '心'}, 'y': {'尢', '又', '夭', '亚', '羊', '酉', '牙', '央', '幺', '曳', '弋', '于', '聿', '也', '夷', '义', '丫', '由', '臾', '玉', '业', '尹', '与', '永', '𧘇', '雨', '尤', '严', '用', '禺', '禹'}, 'z': {'辶', '廴', '自', '子'}}

for k, v in last_py.items():
    for char in v:
        print(f"""("{char}", '{k}'),""")
